<template>
  <ve-histogram :data="chartData" :settings="chartSettings"></ve-histogram>
</template>

<script>
  module.exports = {
    created: function () {
      this.chartData = {
        columns: ['日期', '成本', '利润', '占比'],
        rows: [
          { '日期': '1月', '成本': 1523, '利润': 1523, '占比': 0.12 },
          { '日期': '2月', '成本': 1223, '利润': 1921, '占比': 0.345 },
          { '日期': '3月', '成本': 2123, '利润': 5523, '占比': 0.7 },
          { '日期': '4月', '成本': 4123, '利润': 6523, '占比': 0.31 },
          { '日期': '5月', '成本': 4123, '利润': 6523, '占比': 0.31 },
          { '日期': '6月', '成本': 4123, '利润': 6523, '占比': 0.31 },
          { '日期': '7月', '成本': 4123, '利润': 6523, '占比': 0.31 },
          { '日期': '8月', '成本': 4123, '利润': 6523, '占比': 0.31 },
          { '日期': '9月', '成本': 4123, '利润': 6523, '占比': 0.31 },
          { '日期': '10月', '成本': 4123, '利润': 6523, '占比': 0.31 },
          { '日期': '11月', '成本': 4123, '利润': 6523, '占比': 0.31 },
          { '日期': '12月', '成本': 4123, '利润': 6523, '占比': 0.31 }
        ]
      }
      this.chartSettings = {
        label: {
          normal: { show: true, position: 'top' }
        }
      }
    }
  }
</script>